# SteelElementProperties Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SteelElementProperties Methods
SteelElementProperties Class See Also
---
The SteelElementProperties type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AddFabricationInformationForRevitElements | This method adds fabrication information to the given elements. |
| Dispose | Causes the object to release immediately any resources it may be utilizing. (Inherited from APIObject.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetFabricationUniqueID | This method will return the fabrication id for the given reference. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetReference | This method will return the reference for the given fabrication id. |
| GetSteelElementProperties | Get SteelElementProperties for the input element if they exist. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
SteelElementProperties Class
Autodesk.Revit.DB.Steel Namespace